# tap "homebrew/brew"
# tap "homebrew/cask"
# tap "homebrew/core"
# Cross-platform make
brew "cmake"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# build-essentials for linux
# brew 'build-essential'
# Platform built on V8 to build network applications
brew "node"
# Python version management
brew "pyenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Zsh history substring Search
brew "zsh-history-substring-search"
# Cross-shell prompt for astronauts
brew "starship"
# Modern, maintained replacement for ls
brew "eza"
# Zoxide, A modern cd
brew "zoxide"
# Simple terminal UI for git commands
brew "lazygit"
# Neovim
brew "neovim"
# zsh
brew "zsh"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-jetbrains-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-symbols-only-nerd-font"
